Revit 2026 API

# InsulationLiningBaseThickness Property

---

Thickness of the insulation or lining element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Thickness { get; set; }
```
```vb
Public Property Thickness As Double
	Get
	Set
```
```cpp
public:
property double Thickness {
	double get ();
	void set (double value);
}
```
```fsharp
member Thickness : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: Thickness is not valid for assignment to insulation or lining elements. |

#### Reference

InsulationLiningBase Class

Autodesk.Revit.DB Namespace